app/controllers/profiles_controller.rb

SELECT  "profiles".* FROM "profiles"   ORDER BY "profiles"."id" ASC LIMIT 1
---
	def show
		if signed_in?
  			@profile = Profile.first.search(params[:name])